Repository: Lcc1ccl/cmax
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.browser.hostWhitelist.subtitle
source: Applies to terminal link clicks and intercepted `open https://...` calls. Only these hosts open in cmux. Others open in your default browser. One host or wildcard per line (for example: example.com, *.internal.example). Leave empty to open all hosts in cmux.
ar: ЩҠЩҶШ·ШЁЩӮ Ш№Щ„Щү ЩҶЩӮШұШ§ШӘ Ш§Щ„ШұЩҲШ§ШЁШ· ЩҒЩҠ Ш§Щ„Ш·ШұЩҒЩҠШ© ЩҲШ§ШіШӘШҜШ№Ш§ШЎШ§ШӘ `open https://...` Ш§Щ„Щ…Ш№ШӘШұШ¶Ш©. ЩҒЩӮШ· ЩҮШӨЩ„Ш§ШЎ Ш§Щ„Щ…Ш¶ЩҠЩҒЩҲЩҶ ЩҠЩҒШӘШӯЩҲЩҶ ЩҒЩҠ cmux. Ш§Щ„ШЁЩӮЩҠШ© ШӘЩҒШӘШӯ ЩҒЩҠ Щ…ШӘШөЩҒШӯЩғ Ш§Щ„Ш§ЩҒШӘШұШ§Ш¶ЩҠ. Щ…Ш¶ЩҠЩҒ ЩҲШ§ШӯШҜ ШЈЩҲ ШӯШұЩҒ ШЁШҜЩ„ Щ„ЩғЩ„ ШіШ·Шұ (Щ…Ш«Ш§Щ„: example.com, *.internal.example). Ш§ШӘШұЩғЩҮ ЩҒШ§ШұШәЩӢШ§ Щ„ЩҒШӘШӯ Ш¬Щ…ЩҠШ№ Ш§Щ„Щ…Ш¶ЩҠЩҒЩҠЩҶ ЩҒЩҠ cmux.
bs: Primjenjuje se na klikove linkova u terminalu i presretnute `open https://...` pozive. Samo se ovi hostovi otvaraju u cmux. Ostali se otvaraju u podrazumijevanom pregledniku. Jedan host ili zamjenski znak po redu (na primjer: example.com, *.internal.example). Ostavite prazno da otvorite sve hostove u cmux.
da: GГҰlder for terminallinksklik og opfangede `open https://...`-kald. Kun disse vГҰrter ГҘbnes i cmux. Andre ГҘbnes i din standardbrowser. Гүn vГҰrt eller wildcard pr. linje (f.eks.: example.com, *.internal.example). Lad stГҘ tomt for at ГҘbne alle vГҰrter i cmux.
de: Gilt fГјr Klicks auf Terminal-Links und abgefangene `open https://...`-Aufrufe. Nur diese Hosts werden in cmux geГ¶ffnet. Andere werden in Ihrem Standardbrowser geГ¶ffnet. Ein Host oder Platzhalter pro Zeile (zum Beispiel: example.com, *.internal.example). Leer lassen, um alle Hosts in cmux zu Г¶ffnen.
es: Se aplica a clics en enlaces del terminal y llamadas interceptadas de `open https://...`. Solo estos hosts se abren en cmux. Los demГЎs se abren en tu navegador predeterminado. Un host o comodГӯn por lГӯnea (por ejemplo: example.com, *.internal.example). DГ©jalo vacГӯo para abrir todos los hosts en cmux.
fr: S'applique aux clics sur les liens du terminal et aux appels `open https://...` interceptГ©s. Seuls ces hГҙtes s'ouvrent dans cmux. Les autres s'ouvrent dans votre navigateur par dГ©faut. Un hГҙte ou caractГЁre gГ©nГ©rique par ligne (par exemple : example.com, *.internal.example). Laissez vide pour ouvrir tous les hГҙtes dans cmux.
it: Si applica ai clic sui link nel terminale e alle chiamate intercettate `open https://...`. Solo questi host si aprono in cmux. Gli altri si aprono nel browser predefinito. Un host o wildcard per riga (ad esempio: example.com, *.internal.example). Lascia vuoto per aprire tutti gli host in cmux.
ja: гӮҝгғјгғҹгғҠгғ«гҒ®гғӘгғігӮҜгӮҜгғӘгғғгӮҜгҒҠгӮҲгҒігӮӨгғігӮҝгғјгӮ»гғ—гғҲгҒ•гӮҢгҒҹ`open https://...`е‘јгҒіеҮәгҒ—гҒ«йҒ©з”ЁгҒ•гӮҢгҒҫгҒҷгҖӮгҒ“гӮҢгӮүгҒ®гғӣгӮ№гғҲгҒ®гҒҝcmuxгҒ§й–ӢгҒҚгҒҫгҒҷгҖӮгҒқгҒ®д»–гҒҜгғҮгғ•гӮ©гғ«гғҲгғ–гғ©гӮҰгӮ¶гҒ§й–ӢгҒҚгҒҫгҒҷгҖӮ1иЎҢгҒ«1гҒӨгҒ®гғӣгӮ№гғҲгҒҫгҒҹгҒҜгғҜгӮӨгғ«гғүгӮ«гғјгғүпјҲдҫӢ: example.com, *.internal.exampleпјүгҖӮз©әж¬„гҒ«гҒҷгӮӢгҒЁгҒҷгҒ№гҒҰгҒ®гғӣгӮ№гғҲгӮ’cmuxгҒ§й–ӢгҒҚгҒҫгҒҷгҖӮ
ko: н„°лҜёл„җ л§ҒнҒ¬ нҒҙлҰӯ л°Ҹ мқён„°м…үнҠёлҗң `open https://...` нҳём¶ңм—җ м Ғмҡ©лҗ©лӢҲлӢӨ. мқҙ нҳёмҠӨнҠёл§Ң cmuxм—җм„ң м—ҙлҰҪлӢҲлӢӨ. лӮҳлЁём§ҖлҠ” кё°ліё лёҢлқјмҡ°м Җм—җм„ң м—ҙлҰҪлӢҲлӢӨ. н•ң мӨ„м—җ н•ҳлӮҳмқҳ нҳёмҠӨнҠё лҳҗлҠ” мҷҖмқјл“ңм№ҙл“ң (мҳҲ: example.com, *.internal.example). л№„мӣҢл‘җл©ҙ лӘЁл“ нҳёмҠӨнҠёк°Җ cmuxм—җм„ң м—ҙлҰҪлӢҲлӢӨ.
nb: Gjelder for terminallenkeklikk og avlyttede `open https://...`-kall. Bare disse vertene ГҘpnes i cmux. Andre ГҘpnes i standard nettleser. Гүn vert eller jokertegn per linje (for eksempel: example.com, *.internal.example). La stГҘ tom for ГҘ ГҘpne alle verter i cmux.
pl: Dotyczy klikniДҷДҮ linkГіw w terminalu i przechwyconych wywoЕӮaЕ„ `open https://...`. Tylko te hosty otwierajД… siДҷ w cmux. PozostaЕӮe otwierajД… siДҷ w domyЕӣlnej przeglД…darce. Jeden host lub wzorzec na wiersz (na przykЕӮad: example.com, *.internal.example). Pozostaw puste, aby otwieraДҮ wszystkie hosty w cmux.
pt_br: Aplica-se a cliques em links do terminal e chamadas interceptadas de `open https://...`. Apenas estes hosts abrem no cmux. Outros abrem no seu navegador padrГЈo. Um host ou curinga por linha (por exemplo: example.com, *.internal.example). Deixe vazio para abrir todos os hosts no cmux.
ru: РҹСҖРёРјРөРҪСҸРөСӮСҒСҸ Рә РҪР°Р¶Р°СӮРёСҸРј РҪР° СҒСҒСӢР»РәРё РІ СӮРөСҖРјРёРҪР°Р»Рө Рё РҝРөСҖРөС…РІР°СҮРөРҪРҪСӢРј РІСӢР·РҫРІР°Рј `open https://...`. РўРҫР»СҢРәРҫ СҚСӮРё С…РҫСҒСӮСӢ РҫСӮРәСҖСӢРІР°СҺСӮСҒСҸ РІ cmux. РһСҒСӮР°Р»СҢРҪСӢРө РҫСӮРәСҖСӢРІР°СҺСӮСҒСҸ РІ РұСҖР°СғР·РөСҖРө РҝРҫ СғРјРҫР»СҮР°РҪРёСҺ. РһРҙРёРҪ С…РҫСҒСӮ РёР»Рё СҲР°РұР»РҫРҪ РҪР° СҒСӮСҖРҫРәСғ (РҪР°РҝСҖРёРјРөСҖ: example.com, *.internal.example). РһСҒСӮР°РІСҢСӮРө РҝСғСҒСӮСӢРј, СҮСӮРҫРұСӢ РҫСӮРәСҖСӢРІР°СӮСҢ РІСҒРө С…РҫСҒСӮСӢ РІ cmux.
th: а№ғаёҠа№үаёҒаёұаёҡаёҒаёІаёЈаё„аёҘаёҙаёҒаёҘаёҙаёҮаёҒа№Ңа№ғаёҷа№Җаё—аёӯаёЈа№ҢаёЎаёҙаёҷаёұаёҘа№ҒаёҘаё°аёҒаёІаёЈаё”аёұаёҒаёҲаёұаёҡаё„аёіаёӘаёұа№ҲаёҮ `open https://...` а№ҖаёүаёһаёІаё°а№Ӯаё®аёӘаё•а№Ңа№Җаё«аёҘа№ҲаёІаёҷаёөа№үа№Җаё—а№ҲаёІаёҷаёұа№үаёҷаё—аёөа№ҲаёҲаё°а№Җаёӣаёҙаё”а№ғаёҷ cmux а№Ӯаё®аёӘаё•а№Ңаёӯаё·а№ҲаёҷаёҲаё°а№Җаёӣаёҙаё”а№ғаёҷа№ҖаёҡаёЈаёІаё§а№Ңа№ҖаёӢаёӯаёЈа№Ңа№ҖаёЈаёҙа№ҲаёЎаё•а№үаёҷаёӮаёӯаёҮаё„аёёаё“ а№Ӯаё®аёӘаё•а№Ңаё«аёЈаё·аёӯ wildcard аё«аёҷаё¶а№ҲаёҮаёЈаёІаёўаёҒаёІаёЈаё•а№ҲаёӯаёҡаёЈаёЈаё—аёұаё” (аё•аёұаё§аёӯаёўа№ҲаёІаёҮ: example.com, *.internal.example) а№Җаё§а№үаёҷаё§а№ҲаёІаёҮа№Җаёһаё·а№Ҳаёӯа№Җаёӣаёҙаё”а№Ӯаё®аёӘаё•а№Ңаё—аёұа№үаёҮаё«аёЎаё”а№ғаёҷ cmux
tr: Terminal baДҹlantДұ tДұklamalarДұna ve yakalanan `open https://...` Г§aДҹrДұlarДұna uygulanДұr. YalnДұzca bu ana bilgisayarlar cmux'ta aГ§ДұlДұr. DiДҹerleri varsayДұlan tarayДұcДұnДұzda aГ§ДұlДұr. SatДұr baЕҹДұna bir ana bilgisayar veya joker karakter (Г¶rneДҹin: example.com, *.internal.example). TГјm ana bilgisayarlarДұ cmux'ta aГ§mak iГ§in boЕҹ bДұrakДұn.
uk: Р—Р°СҒСӮРҫСҒРҫРІСғС”СӮСҢСҒСҸ РҙРҫ РәР»С–РәС–РІ РҪР° РҝРҫСҒРёР»Р°РҪРҪСҸ РІ СӮРөСҖРјС–РҪР°Р»С– СӮР° РҝРөСҖРөС…РҫРҝР»РөРҪРёС… РІРёРәР»РёРәС–РІ `open https://...`. РўС–Р»СҢРәРё СҶС– С…РҫСҒСӮРё РІС–РҙРәСҖРёРІР°СҺСӮСҢСҒСҸ РІ cmux. РҶРҪСҲС– РІС–РҙРәСҖРёРІР°СҺСӮСҢСҒСҸ Сғ СҒСӮР°РҪРҙР°СҖСӮРҪРҫРјСғ РұСҖР°СғР·РөСҖС–. РһРҙРёРҪ С…РҫСҒСӮ Р°РұРҫ СҲР°РұР»РҫРҪ РҪР° СҖСҸРҙРҫРә (РҪР°РҝСҖРёРәР»Р°Рҙ: example.com, *.internal.example). Р—Р°Р»РёСҲСӮРө РҝРҫСҖРҫР¶РҪС–Рј, СүРҫРұ РІС–РҙРәСҖРёРІР°СӮРё РІСҒС– С…РҫСҒСӮРё РІ cmux.
zh_hans: йҖӮз”ЁдәҺз»Ҳз«Ҝдёӯзҡ„й“ҫжҺҘзӮ№еҮ»е’ҢжӢҰжҲӘзҡ„ `open https://...` и°ғз”ЁгҖӮд»…иҝҷдәӣдё»жңәеңЁ cmux дёӯжү“ејҖпјҢе…¶д»–дё»жңәеңЁй»ҳи®ӨжөҸи§ҲеҷЁдёӯжү“ејҖгҖӮжҜҸиЎҢдёҖдёӘдё»жңәжҲ–йҖҡй…Қз¬ҰпјҲдҫӢеҰӮпјҡexample.comгҖҒ*.internal.exampleпјүгҖӮз•ҷз©әеҲҷеңЁ cmux дёӯжү“ејҖжүҖжңүдё»жңәгҖӮ
zh_hant: еҘ—з”Ёж–јзөӮз«Ҝж©ҹйҖЈзөҗй»һж“Ҡе’Ңж””жҲӘзҡ„ `open https://...` е‘јеҸ«гҖӮеғ…йҖҷдәӣдё»ж©ҹжңғеңЁ cmux дёӯй–Ӣе•ҹпјҢе…¶д»–дё»ж©ҹжңғеңЁжӮЁзҡ„й җиЁӯзҖҸиҰҪеҷЁдёӯй–Ӣе•ҹгҖӮжҜҸиЎҢдёҖеҖӢдё»ж©ҹжҲ–иҗ¬з”Ёеӯ—е…ғпјҲдҫӢеҰӮпјҡexample.comгҖҒ*.internal.exampleпјүгҖӮз•ҷз©әеүҮеңЁ cmux дёӯй–Ӣе•ҹжүҖжңүдё»ж©ҹгҖӮ

# settings.browser.httpAllowlist
source: HTTP Hosts Allowed in Embedded Browser
ar: Щ…Ш¶ЩҠЩҒЩҲ HTTP Ш§Щ„Щ…ШіЩ…ЩҲШӯ ШЁЩҮЩ… ЩҒЩҠ Ш§Щ„Щ…ШӘШөЩҒШӯ Ш§Щ„Щ…Ш¶Щ…Щ‘ЩҶ
bs: HTTP hostovi dozvoljeni u ugraД‘enom pregledniku
da: HTTP-vГҰrter tilladt i den indlejrede browser
de: HTTP-Hosts, die im integrierten Browser zugelassen sind
es: Hosts HTTP permitidos en el navegador integrado
fr: HГҙtes HTTP autorisГ©s dans le navigateur intГ©grГ©
it: Host HTTP consentiti nel browser integrato
ja: еҶ…и”өгғ–гғ©гӮҰгӮ¶гҒ§иЁұеҸҜгҒҷгӮӢHTTPгғӣгӮ№гғҲ
ko: лӮҙмһҘ лёҢлқјмҡ°м Җм—җм„ң н—Ҳмҡ©н• HTTP нҳёмҠӨнҠё
nb: HTTP-verter tillatt i innebygd nettleser
pl: Hosty HTTP dozwolone we wbudowanej przeglД…darce
pt_br: Hosts HTTP Permitidos no Navegador Integrado
ru: HTTP-С…РҫСҒСӮСӢ, СҖР°Р·СҖРөСҲРөРҪРҪСӢРө РІРҫ РІСҒСӮСҖРҫРөРҪРҪРҫРј РұСҖР°СғР·РөСҖРө
th: а№Ӯаё®аёӘаё•а№Ң HTTP аё—аёөа№ҲаёӯаёҷаёёаёҚаёІаё•а№ғаёҷа№ҖаёҡаёЈаёІаё§а№Ңа№ҖаёӢаёӯаёЈа№Ңа№ғаёҷаё•аёұаё§
tr: GГ¶mГјlГј TarayДұcДұda Д°zin Verilen HTTP Ana BilgisayarlarДұ
uk: HTTP-С…РҫСҒСӮРё, РҙРҫР·РІРҫР»РөРҪС– Сғ РІРұСғРҙРҫРІР°РҪРҫРјСғ РұСҖР°СғР·РөСҖС–
zh_hans: еҶ…еөҢжөҸи§ҲеҷЁдёӯе…Ғи®ёзҡ„ HTTP дё»жңә
zh_hant: е…ҒиЁұеңЁе…§е»әзҖҸиҰҪеҷЁдёӯдҪҝз”Ёзҡ„ HTTP дё»ж©ҹ

# settings.browser.httpAllowlist.description
source: Controls which HTTP (non-HTTPS) hosts can open in cmux without a warning prompt. Defaults include localhost, 127.0.0.1, ::1, 0.0.0.0, and *.localtest.me.
ar: ЩҠШӘШӯЩғЩ… ЩҒЩҠ Щ…Ш¶ЩҠЩҒЩҠ HTTP (ШәЩҠШұ HTTPS) Ш§Щ„Ш°ЩҠЩҶ ЩҠЩ…ЩғЩҶЩҮЩ… Ш§Щ„ЩҒШӘШӯ ЩҒЩҠ cmux ШЁШҜЩҲЩҶ ШұШіШ§Щ„Ш© ШӘШӯШ°ЩҠШұ. Ш§Щ„Ш§ЩҒШӘШұШ§Ш¶ЩҠШ§ШӘ ШӘШҙЩ…Щ„ localhost ЩҲ 127.0.0.1 ЩҲ ::1 ЩҲ 0.0.0.0 ЩҲ *.localtest.me.
bs: KontroliЕЎe koji HTTP (ne-HTTPS) hostovi mogu biti otvoreni u cmux bez upozorenja. Podrazumijevani ukljuДҚuju localhost, 127.0.0.1, ::1, 0.0.0.0 i *.localtest.me.
da: Styrer hvilke HTTP-vГҰrter (ikke-HTTPS) der kan ГҘbnes i cmux uden advarselsmeddelelse. Standardindstillinger inkluderer localhost, 127.0.0.1, ::1, 0.0.0.0 og *.localtest.me.
de: Steuert, welche HTTP-Hosts (nicht HTTPS) ohne Warnhinweis in cmux geГ¶ffnet werden kГ¶nnen. StandardmГӨГҹig enthalten: localhost, 127.0.0.1, ::1, 0.0.0.0 und *.localtest.me.
es: Controla quГ© hosts HTTP (no HTTPS) pueden abrirse en cmux sin un mensaje de advertencia. Los valores predeterminados incluyen localhost, 127.0.0.1, ::1, 0.0.0.0 y *.localtest.me.
fr: ContrГҙle quels hГҙtes HTTP (non HTTPS) peuvent s'ouvrir dans cmux sans avertissement. Les valeurs par dГ©faut incluent localhost, 127.0.0.1, ::1, 0.0.0.0 et *.localtest.me.
it: Controlla quali host HTTP (non HTTPS) possono aprirsi in cmux senza un avviso. I valori predefiniti includono localhost, 127.0.0.1, ::1, 0.0.0.0 e *.localtest.me.
ja: иӯҰе‘Ҡгғ—гғӯгғігғ—гғҲгҒӘгҒ—гҒ§cmuxгҒ§й–ӢгҒ‘гӮӢHTTPпјҲйқһHTTPSпјүгғӣгӮ№гғҲгӮ’еҲ¶еҫЎгҒ—гҒҫгҒҷгҖӮгғҮгғ•гӮ©гғ«гғҲгҒ«гҒҜlocalhostгҖҒ127.0.0.1гҖҒ::1гҖҒ0.0.0.0гҖҒ*.localtest.meгҒҢеҗ«гҒҫгӮҢгҒҫгҒҷгҖӮ
ko: cmuxм—җм„ң кІҪкі м—Ҷмқҙ м—ҙ мҲҳ мһҲлҠ” HTTP(л№„HTTPS) нҳёмҠӨнҠёлҘј м ңм–ҙн•©лӢҲлӢӨ. кё°ліёк°’м—җлҠ” localhost, 127.0.0.1, ::1, 0.0.0.0 л°Ҹ *.localtest.meк°Җ нҸ¬н•Ёлҗ©лӢҲлӢӨ.
nb: Styrer hvilke HTTP-verter (ikke HTTPS) som kan ГҘpnes i cmux uten advarselsmelding. Standardverdier inkluderer localhost, 127.0.0.1, ::1, 0.0.0.0 og *.localtest.me.
pl: OkreЕӣla, ktГіre hosty HTTP (inne niЕј HTTPS) mogД… byДҮ otwierane w cmux bez ostrzeЕјenia. DomyЕӣlnie uwzglДҷdniono localhost, 127.0.0.1, ::1, 0.0.0.0 i *.localtest.me.
pt_br: Controla quais hosts HTTP (nГЈo HTTPS) podem abrir no cmux sem um aviso. Os padrГөes incluem localhost, 127.0.0.1, ::1, 0.0.0.0 e *.localtest.me.
ru: РһРҝСҖРөРҙРөР»СҸРөСӮ, РәР°РәРёРө HTTP (РҪРө HTTPS) С…РҫСҒСӮСӢ РјРҫРіСғСӮ РҫСӮРәСҖСӢРІР°СӮСҢСҒСҸ РІ cmux РұРөР· РҝСҖРөРҙСғРҝСҖРөР¶РҙРөРҪРёСҸ. РҹРҫ СғРјРҫР»СҮР°РҪРёСҺ РІРәР»СҺСҮРөРҪСӢ localhost, 127.0.0.1, ::1, 0.0.0.0 Рё *.localtest.me.
th: аё„аё§аёҡаё„аёёаёЎаё§а№ҲаёІа№Ӯаё®аёӘаё•а№Ң HTTP (а№„аёЎа№Ҳа№ғаёҠа№Ҳ HTTPS) а№ғаё”аё—аёөа№ҲаёӘаёІаёЎаёІаёЈаё–а№Җаёӣаёҙаё”а№ғаёҷ cmux а№Ӯаё”аёўа№„аёЎа№Ҳаё•а№үаёӯаёҮа№ҒаёӘаё”аёҮаё„аёіа№Җаё•аё·аёӯаёҷ аё„а№ҲаёІа№ҖаёЈаёҙа№ҲаёЎаё•а№үаёҷаёЈаё§аёЎаё–аё¶аёҮ localhost, 127.0.0.1, ::1, 0.0.0.0 а№ҒаёҘаё° *.localtest.me
tr: Hangi HTTP (HTTPS olmayan) ana bilgisayarlarДұnДұn cmux'ta uyarДұ istemi olmadan aГ§ДұlabileceДҹini kontrol eder. VarsayДұlanlar localhost, 127.0.0.1, ::1, 0.0.0.0 ve *.localtest.me iГ§erir.
uk: Р’РёР·РҪР°СҮР°С”, СҸРәС– HTTP (РҪРө HTTPS) С…РҫСҒСӮРё РјРҫР¶СғСӮСҢ РІС–РҙРәСҖРёРІР°СӮРёСҒСҸ РІ cmux РұРөР· РҝРҫРҝРөСҖРөРҙР¶РөРҪРҪСҸ. РўРёРҝРҫРІРҫ РІРәР»СҺСҮР°С” localhost, 127.0.0.1, ::1, 0.0.0.0 СӮР° *.localtest.me.
zh_hans: жҺ§еҲ¶е“Әдәӣ HTTPпјҲйқһ HTTPSпјүдё»жңәеҸҜд»ҘеңЁ cmux дёӯжү“ејҖиҖҢдёҚжҳҫзӨәиӯҰе‘ҠжҸҗзӨәгҖӮй»ҳи®ӨеҢ…жӢ¬ localhostгҖҒ127.0.0.1гҖҒ::1гҖҒ0.0.0.0 е’Ң *.localtest.meгҖӮ
zh_hant: жҺ§еҲ¶е“Әдәӣ HTTPпјҲйқһ HTTPSпјүдё»ж©ҹеҸҜд»ҘеңЁ cmux дёӯй–Ӣе•ҹиҖҢдёҚйЎҜзӨәиӯҰе‘ҠжҸҗзӨәгҖӮй җиЁӯеҢ…еҗ« localhostгҖҒ127.0.0.1гҖҒ::1гҖҒ0.0.0.0 е’Ң *.localtest.meгҖӮ

# settings.browser.httpAllowlist.hint
source: One host or wildcard per line (for example: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
ar: Щ…Ш¶ЩҠЩҒ ЩҲШ§ШӯШҜ ШЈЩҲ ШӯШұЩҒ ШЁШҜЩ„ Щ„ЩғЩ„ ШіШ·Шұ (Щ…Ш«Ш§Щ„: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
bs: Jedan host ili zamjenski znak po redu (na primjer: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
da: Гүn vГҰrt eller wildcard pr. linje (f.eks.: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
de: Ein Host oder Platzhalter pro Zeile (zum Beispiel: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
es: Un host o comodГӯn por lГӯnea (por ejemplo: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
fr: Un hГҙte ou caractГЁre gГ©nГ©rique par ligne (par exemple : localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
it: Un host o wildcard per riga (ad esempio: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
ja: 1иЎҢгҒ«1гҒӨгҒ®гғӣгӮ№гғҲгҒҫгҒҹгҒҜгғҜгӮӨгғ«гғүгӮ«гғјгғүпјҲдҫӢ: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.meпјүгҖӮ
ko: н•ң мӨ„м—җ н•ҳлӮҳмқҳ нҳёмҠӨнҠё лҳҗлҠ” мҷҖмқјл“ңм№ҙл“ң (мҳҲ: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
nb: Гүn vert eller jokertegn per linje (for eksempel: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
pl: Jeden host lub wzorzec na wiersz (na przykЕӮad: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
pt_br: Um host ou curinga por linha (por exemplo: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
ru: РһРҙРёРҪ С…РҫСҒСӮ РёР»Рё СҲР°РұР»РҫРҪ РҪР° СҒСӮСҖРҫРәСғ (РҪР°РҝСҖРёРјРөСҖ: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
th: а№Ӯаё®аёӘаё•а№Ңаё«аёЈаё·аёӯ wildcard аё«аёҷаё¶а№ҲаёҮаёЈаёІаёўаёҒаёІаёЈаё•а№ҲаёӯаёҡаёЈаёЈаё—аёұаё” (аё•аёұаё§аёӯаёўа№ҲаёІаёҮ: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me)
tr: SatДұr baЕҹДұna bir ana bilgisayar veya joker karakter (Г¶rneДҹin: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
uk: РһРҙРёРҪ С…РҫСҒСӮ Р°РұРҫ СҲР°РұР»РҫРҪ РҪР° СҖСҸРҙРҫРә (РҪР°РҝСҖРёРәР»Р°Рҙ: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
zh_hans: жҜҸиЎҢдёҖдёӘдё»жңәжҲ–йҖҡй…Қз¬ҰпјҲдҫӢеҰӮпјҡlocalhostгҖҒ127.0.0.1гҖҒ::1гҖҒ0.0.0.0гҖҒ*.localtest.meпјүгҖӮ
zh_hant: жҜҸиЎҢдёҖеҖӢдё»ж©ҹжҲ–иҗ¬з”Ёеӯ—е…ғпјҲдҫӢеҰӮпјҡlocalhostгҖҒ127.0.0.1гҖҒ::1гҖҒ0.0.0.0гҖҒ*.localtest.meпјүгҖӮ

# settings.browser.httpAllowlist.save
source: Save
ar: ШӯЩҒШё
bs: Spremi
da: Gem
de: Speichern
es: Guardar
fr: Enregistrer
it: Salva
ja: дҝқеӯҳ
ko: м ҖмһҘ
nb: Lagre
pl: Zapisz
pt_br: Salvar
ru: РЎРҫС…СҖР°РҪРёСӮСҢ
th: аёҡаёұаёҷаё—аё¶аёҒ
tr: Kaydet
uk: Р—РұРөСҖРөРіСӮРё
zh_hans: дҝқеӯҳ
zh_hant: е„Іеӯҳ

# settings.browser.interceptOpen
source: Intercept open http(s) in Terminal
ar: Ш§Ш№ШӘШұШ§Ш¶ open http(s) ЩҒЩҠ Ш§Щ„Ш·ШұЩҒЩҠШ©
bs: Presretni open http(s) u Terminalu
da: Opfang open http(s) i terminal
de: open http(s) im Terminal abfangen
es: Interceptar open http(s) en Terminal
fr: Intercepter open http(s) dans le terminal
it: Intercetta open http(s) nel terminale
ja: гӮҝгғјгғҹгғҠгғ«гҒ§open http(s)гӮ’гӮӨгғігӮҝгғјгӮ»гғ—гғҲ
ko: н„°лҜёл„җм—җм„ң open http(s) мқён„°м…үнҠё
nb: Avlytt open http(s) i terminal
pl: Przechwytuj open http(s) w terminalu
pt_br: Interceptar open http(s) no Terminal
ru: РҹРөСҖРөС…РІР°СӮСӢРІР°СӮСҢ open http(s) РІ СӮРөСҖРјРёРҪР°Р»Рө
th: аё”аёұаёҒаёҲаёұаёҡ open http(s) а№ғаёҷа№Җаё—аёӯаёЈа№ҢаёЎаёҙаёҷаёұаёҘ
tr: Terminalde open http(s) KomutlarДұnДұ Yakala
uk: РҹРөСҖРөС…РҫРҝР»СҺРІР°СӮРё open http(s) Сғ СӮРөСҖРјС–РҪР°Р»С–
zh_hans: еңЁз»Ҳз«ҜдёӯжӢҰжҲӘ open http(s)
zh_hant: еңЁзөӮз«Ҝж©ҹдёӯж””жҲӘ open http(s)

# settings.browser.interceptOpen.subtitle
source: When off, `open https://...` and `open http://...` always use your default browser.
ar: Ш№ЩҶШҜ Ш§Щ„ШӘШ№Ш·ЩҠЩ„ШҢ ЩҠШіШӘШ®ШҜЩ… `open https://...` ЩҲ `open http://...` ШҜШ§ШҰЩ…ЩӢШ§ Щ…ШӘШөЩҒШӯЩғ Ш§Щ„Ш§ЩҒШӘШұШ§Ш¶ЩҠ.
bs: Kada je iskljuДҚeno, `open https://...` i `open http://...` uvijek koriste podrazumijevani preglednik.
da: NГҘr deaktiveret, bruger `open https://...` og `open http://...` altid din standardbrowser.
de: Wenn deaktiviert, verwenden `open https://...` und `open http://...` immer Ihren Standardbrowser.
es: Cuando estГЎ desactivado, `open https://...` y `open http://...` siempre usan tu navegador predeterminado.
fr: Lorsque dГ©sactivГ©, `open https://...` et `open http://...` utilisent toujours votre navigateur par dГ©faut.
it: Quando disattivato, `open https://...` e `open http://...` usano sempre il browser predefinito.
ja: гӮӘгғ•гҒ®е ҙеҗҲгҖҒ`open https://...`гҒҠгӮҲгҒі`open http://...`гҒҜеёёгҒ«гғҮгғ•гӮ©гғ«гғҲгғ–гғ©гӮҰгӮ¶гӮ’дҪҝз”ЁгҒ—гҒҫгҒҷгҖӮ
ko: л№„нҷңм„ұнҷ”н•ҳл©ҙ `open https://...` л°Ҹ `open http://...`к°Җ н•ӯмғҒ кё°ліё лёҢлқјмҡ°м ҖлҘј мӮ¬мҡ©н•©лӢҲлӢӨ.
nb: NГҘr av, bruker `open https://...` og `open http://...` alltid standard nettleser.
pl: Po wyЕӮД…czeniu `open https://...` i `open http://...` zawsze uЕјywajД… domyЕӣlnej przeglД…darki.
pt_br: Quando desativado, `open https://...` e `open http://...` sempre usam seu navegador padrГЈo.
ru: РҹСҖРё РҫСӮРәР»СҺСҮРөРҪРёРё `open https://...` Рё `open http://...` РІСҒРөРіРҙР° РёСҒРҝРҫР»СҢР·СғСҺСӮ РұСҖР°СғР·РөСҖ РҝРҫ СғРјРҫР»СҮР°РҪРёСҺ.
th: а№ҖаёЎаё·а№Ҳаёӯаёӣаёҙаё” `open https://...` а№ҒаёҘаё° `open http://...` аёҲаё°а№ғаёҠа№үа№ҖаёҡаёЈаёІаё§а№Ңа№ҖаёӢаёӯаёЈа№Ңа№ҖаёЈаёҙа№ҲаёЎаё•а№үаёҷаёӮаёӯаёҮаё„аёёаё“а№ҖаёӘаёЎаёӯ
tr: KapalДұyken, `open https://...` ve `open http://...` her zaman varsayДұlan tarayДұcДұnДұzДұ kullanДұr.
uk: РҜРәСүРҫ РІРёРјРәРҪРөРҪРҫ, `open https://...` СӮР° `open http://...` Р·Р°РІР¶РҙРё РІРёРәРҫСҖРёСҒСӮРҫРІСғСҺСӮСҢ СҒСӮР°РҪРҙР°СҖСӮРҪРёР№ РұСҖР°СғР·РөСҖ.
zh_hans: е…ій—ӯеҗҺпјҢ`open https://...` е’Ң `open http://...` е§Ӣз»ҲдҪҝз”Ёй»ҳи®ӨжөҸи§ҲеҷЁгҖӮ
zh_hant: й—ңй–үжҷӮпјҢ`open https://...` е’Ң `open http://...` дёҖеҫӢдҪҝз”ЁжӮЁзҡ„й җиЁӯзҖҸиҰҪеҷЁгҖӮ

# settings.browser.openTerminalLinks
source: Open Terminal Links in cmux Browser
ar: ЩҒШӘШӯ ШұЩҲШ§ШЁШ· Ш§Щ„Ш·ШұЩҒЩҠШ© ЩҒЩҠ Щ…ШӘШөЩҒШӯ cmux
bs: Otvori linkove terminala u cmux pregledniku
da: Г…bn terminallinks i cmux-browser
de: Terminal-Links im cmux-Browser Г¶ffnen
es: Abrir enlaces del terminal en el navegador de cmux
fr: Ouvrir les liens du terminal dans le navigateur cmux
it: Apri link del terminale nel browser cmux
ja: гӮҝгғјгғҹгғҠгғ«гҒ®гғӘгғігӮҜгӮ’cmuxгғ–гғ©гӮҰгӮ¶гҒ§й–ӢгҒҸ
ko: н„°лҜёл„җ л§ҒнҒ¬лҘј cmux лёҢлқјмҡ°м Җм—җм„ң м—ҙкё°
nb: Г…pne terminallenker i cmux-nettleser
pl: Otwieraj linki terminala w przeglД…darce cmux
pt_br: Abrir Links do Terminal no Navegador do cmux
ru: РһСӮРәСҖСӢРІР°СӮСҢ СҒСҒСӢР»РәРё РёР· СӮРөСҖРјРёРҪР°Р»Р° РІ РұСҖР°СғР·РөСҖРө cmux
th: а№Җаёӣаёҙаё”аёҘаёҙаёҮаёҒа№Ңа№Җаё—аёӯаёЈа№ҢаёЎаёҙаёҷаёұаёҘа№ғаёҷа№ҖаёҡаёЈаёІаё§а№Ңа№ҖаёӢаёӯаёЈа№Ң cmux
tr: Terminal BaДҹlantДұlarДұnДұ cmux TarayДұcДұsДұnda AГ§
uk: Р’С–РҙРәСҖРёРІР°СӮРё РҝРҫСҒРёР»Р°РҪРҪСҸ СӮРөСҖРјС–РҪР°Р»Сғ Сғ РұСҖР°СғР·РөСҖС– cmux
zh_hans: еңЁ cmux жөҸи§ҲеҷЁдёӯжү“ејҖз»Ҳз«Ҝй“ҫжҺҘ
zh_hant: еңЁ cmux зҖҸиҰҪеҷЁдёӯй–Ӣе•ҹзөӮз«Ҝж©ҹйҖЈзөҗ

# settings.browser.openTerminalLinks.subtitle
source: When off, links clicked in terminal output open in your default browser.
ar: Ш№ЩҶШҜ Ш§Щ„ШӘШ№Ш·ЩҠЩ„ШҢ ШӘЩҒШӘШӯ Ш§Щ„ШұЩҲШ§ШЁШ· Ш§Щ„Щ…ЩҶЩӮЩҲШұШ© ЩҒЩҠ Щ…Ш®ШұШ¬Ш§ШӘ Ш§Щ„Ш·ШұЩҒЩҠШ© ЩҒЩҠ Щ…ШӘШөЩҒШӯЩғ Ш§Щ„Ш§ЩҒШӘШұШ§Ш¶ЩҠ.
bs: Kada je iskljuДҚeno, linkovi kliknuti u izlazu terminala se otvaraju u podrazumijevanom pregledniku.
da: NГҘr deaktiveret, ГҘbnes links, der klikkes i terminaloutput, i din standardbrowser.
de: Wenn deaktiviert, werden im Terminal angeklickte Links in Ihrem Standardbrowser geГ¶ffnet.
es: Cuando estГЎ desactivado, los enlaces en la salida del terminal se abren en tu navegador predeterminado.
fr: Lorsque dГ©sactivГ©, les liens cliquГ©s dans la sortie du terminal s'ouvrent dans votre navigateur par dГ©faut.
it: Quando disattivato, i link cliccati nell'output del terminale si aprono nel browser predefinito.
ja: гӮӘгғ•гҒ®е ҙеҗҲгҖҒгӮҝгғјгғҹгғҠгғ«еҮәеҠӣгҒ®гғӘгғігӮҜгҒҜгғҮгғ•гӮ©гғ«гғҲгғ–гғ©гӮҰгӮ¶гҒ§й–ӢгҒҚгҒҫгҒҷгҖӮ
ko: л№„нҷңм„ұнҷ”н•ҳл©ҙ н„°лҜёл„җ м¶ңл Ҙм—җм„ң нҒҙлҰӯн•ң л§ҒнҒ¬к°Җ кё°ліё лёҢлқјмҡ°м Җм—җм„ң м—ҙлҰҪлӢҲлӢӨ.
nb: NГҘr av, ГҘpnes lenker som klikkes i terminalutdata i standard nettleser.
pl: Po wyЕӮД…czeniu linki klikniДҷte w terminalu otwierajД… siДҷ w domyЕӣlnej przeglД…darce.
pt_br: Quando desativado, links clicados na saГӯda do terminal abrem no seu navegador padrГЈo.
ru: РҹСҖРё РҫСӮРәР»СҺСҮРөРҪРёРё СҒСҒСӢР»РәРё РёР· СӮРөСҖРјРёРҪР°Р»Р° РҫСӮРәСҖСӢРІР°СҺСӮСҒСҸ РІ РұСҖР°СғР·РөСҖРө РҝРҫ СғРјРҫР»СҮР°РҪРёСҺ.
th: а№ҖаёЎаё·а№Ҳаёӯаёӣаёҙаё” аёҘаёҙаёҮаёҒа№Ңаё—аёөа№Ҳаё„аёҘаёҙаёҒа№ғаёҷа№ҖаёӯаёІаё•а№Ңаёһаёёаё•а№Җаё—аёӯаёЈа№ҢаёЎаёҙаёҷаёұаёҘаёҲаё°а№Җаёӣаёҙаё”а№ғаёҷа№ҖаёҡаёЈаёІаё§а№Ңа№ҖаёӢаёӯаёЈа№Ңа№ҖаёЈаёҙа№ҲаёЎаё•а№үаёҷаёӮаёӯаёҮаё„аёёаё“
tr: KapalДұyken, terminal Г§ДұktДұsДұnda tДұklanan baДҹlantДұlar varsayДұlan tarayДұcДұnДұzda aГ§ДұlДұr.
uk: РҜРәСүРҫ РІРёРјРәРҪРөРҪРҫ, РҝРҫСҒРёР»Р°РҪРҪСҸ Сғ РІРёРІРҫРҙС– СӮРөСҖРјС–РҪР°Р»Сғ РІС–РҙРәСҖРёРІР°СҺСӮСҢСҒСҸ Сғ СҒСӮР°РҪРҙР°СҖСӮРҪРҫРјСғ РұСҖР°СғР·РөСҖС–.
zh_hans: е…ій—ӯеҗҺпјҢз»Ҳз«Ҝиҫ“еҮәдёӯзӮ№еҮ»зҡ„й“ҫжҺҘеңЁй»ҳи®ӨжөҸи§ҲеҷЁдёӯжү“ејҖгҖӮ
zh_hant: й—ңй–үжҷӮпјҢзөӮз«Ҝж©ҹијёеҮәдёӯй»һж“Ҡзҡ„йҖЈзөҗжңғеңЁжӮЁзҡ„й җиЁӯзҖҸиҰҪеҷЁдёӯй–Ӣе•ҹгҖӮ

# settings.browser.searchEngine
source: Default Search Engine
ar: Щ…ШӯШұЩғ Ш§Щ„ШЁШӯШ« Ш§Щ„Ш§ЩҒШӘШұШ§Ш¶ЩҠ
bs: Podrazumijevani pretraЕҫivaДҚ
da: StandardsГёgemaskine
de: Standardsuchmaschine
es: Motor de bГәsqueda predeterminado
fr: Moteur de recherche par dГ©faut
it: Motore di ricerca predefinito
ja: гғҮгғ•гӮ©гғ«гғҲжӨңзҙўгӮЁгғігӮёгғі
ko: кё°ліё кІҖмғү м—”м§„
nb: Standard sГёkemotor
pl: DomyЕӣlna wyszukiwarka
pt_br: Motor de Busca PadrГЈo
ru: РҹРҫРёСҒРәРҫРІР°СҸ СҒРёСҒСӮРөРјР° РҝРҫ СғРјРҫР»СҮР°РҪРёСҺ
th: а№Җаё„аёЈаё·а№ҲаёӯаёҮаёЎаё·аёӯаё„а№үаёҷаё«аёІа№ҖаёЈаёҙа№ҲаёЎаё•а№үаёҷ
tr: VarsayДұlan Arama Motoru
uk: РЎСӮР°РҪРҙР°СҖСӮРҪР° РҝРҫСҲСғРәРҫРІР° СҒРёСҒСӮРөРјР°
zh_hans: й»ҳи®Өжҗңзҙўеј•ж“Һ
zh_hant: й җиЁӯжҗңе°Ӣеј•ж“Һ

# settings.browser.searchEngine.subtitle
source: Used by the browser address bar when input is not a URL.
ar: ЩҠЩҸШіШӘШ®ШҜЩ… ШЁЩҲШ§ШіШ·Ш© ШҙШұЩҠШ· Ш№ЩҶЩҲШ§ЩҶ Ш§Щ„Щ…ШӘШөЩҒШӯ Ш№ЩҶШҜЩ…Ш§ Щ„Ш§ ЩҠЩғЩҲЩҶ Ш§Щ„ШҘШҜШ®Ш§Щ„ URL.
bs: Koristi se u adresnoj traci preglednika kada unos nije URL.
da: Bruges af browserens adresselinje, nГҘr input ikke er en URL.
de: Wird von der Browser-Adressleiste verwendet, wenn die Eingabe keine URL ist.
es: Usado por la barra de direcciones del navegador cuando la entrada no es una URL.
fr: UtilisГ© par la barre d'adresse du navigateur lorsque la saisie n'est pas une URL.
it: Utilizzato dalla barra degli indirizzi del browser quando l'input non ГЁ un URL.
ja: гғ–гғ©гӮҰгӮ¶гҒ®гӮўгғүгғ¬гӮ№гғҗгғјгҒ§е…ҘеҠӣгҒҢURLгҒ§гҒӘгҒ„е ҙеҗҲгҒ«дҪҝз”ЁгҒ•гӮҢгҒҫгҒҷгҖӮ
ko: мһ…л Ҙмқҙ URLмқҙ м•„лӢҢ кІҪмҡ° лёҢлқјмҡ°м Җ мЈјмҶҢ н‘ңмӢңмӨ„м—җм„ң мӮ¬мҡ©лҗ©лӢҲлӢӨ.
nb: Brukes av adressefeltet i nettleseren nГҘr inndataen ikke er en URL.
pl: UЕјywana przez pasek adresu przeglД…darki, gdy dane wejЕӣciowe nie sД… adresem URL.
pt_br: Usado pela barra de endereГ§o do navegador quando a entrada nГЈo Г© uma URL.
ru: РҳСҒРҝРҫР»СҢР·СғРөСӮСҒСҸ Р°РҙСҖРөСҒРҪРҫР№ СҒСӮСҖРҫРәРҫР№ РұСҖР°СғР·РөСҖР°, РәРҫРіРҙР° РІРІРҫРҙ РҪРө СҸРІР»СҸРөСӮСҒСҸ URL.
th: а№ғаёҠа№үа№Ӯаё”аёўа№Ғаё–аёҡаё—аёөа№Ҳаёӯаёўаё№а№Ҳа№ҖаёҡаёЈаёІаё§а№Ңа№ҖаёӢаёӯаёЈа№Ңа№ҖаёЎаё·а№Ҳаёӯаёӯаёҙаёҷаёһаёёаё•а№„аёЎа№Ҳа№ғаёҠа№Ҳ URL
tr: GiriЕҹ bir URL olmadДұДҹДұnda tarayДұcДұ adres Г§ubuДҹu tarafДұndan kullanДұlДұr.
uk: Р’РёРәРҫСҖРёСҒСӮРҫРІСғС”СӮСҢСҒСҸ Р°РҙСҖРөСҒРҪРёРј СҖСҸРҙРәРҫРј РұСҖР°СғР·РөСҖР°, РәРҫР»Рё РІРІРөРҙРөРҪРҪСҸ РҪРө С” URL.
zh_hans: жөҸи§ҲеҷЁең°еқҖж Ҹдёӯиҫ“е…Ҙйқһ URL еҶ…е®№ж—¶дҪҝз”ЁгҖӮ
zh_hant: з•¶зҖҸиҰҪеҷЁз¶ІеқҖеҲ—зҡ„ијёе…ҘдёҚжҳҜ URL жҷӮдҪҝз”ЁгҖӮ

# settings.browser.searchSuggestions
source: Show Search Suggestions
ar: Ш№ШұШ¶ Ш§ЩӮШӘШұШ§ШӯШ§ШӘ Ш§Щ„ШЁШӯШ«
bs: PrikaЕҫi prijedloge pretrage
da: Vis sГёgeforslag
de: SuchvorschlГӨge anzeigen
es: Mostrar sugerencias de bГәsqueda
fr: Afficher les suggestions de recherche
it: Mostra suggerimenti di ricerca
ja: жӨңзҙўеҖҷиЈңгӮ’иЎЁзӨә
ko: кІҖмғү м ңм•Ҳ н‘ңмӢң
nb: Vis sГёkeforslag
pl: PokaЕј podpowiedzi wyszukiwania
pt_br: Mostrar SugestГөes de Pesquisa
ru: РҹРҫРәР°Р·СӢРІР°СӮСҢ РҝРҫРёСҒРәРҫРІСӢРө РҝРҫРҙСҒРәР°Р·РәРё
th: а№ҒаёӘаё”аёҮаё„аёіа№Ғаёҷаё°аёҷаёіаёҒаёІаёЈаё„а№үаёҷаё«аёІ
tr: Arama Г–nerilerini GГ¶ster
uk: РҹРҫРәР°Р·СғРІР°СӮРё РҝС–РҙРәР°Р·РәРё РҝРҫСҲСғРәСғ
zh_hans: жҳҫзӨәжҗңзҙўе»әи®®
zh_hant: йЎҜзӨәжҗңе°Ӣе»әиӯ°
